package config;

import java.util.LinkedHashMap;
import java.util.Map;

/**
 * Description: 手机号-国际区号配置
 * Author: hht
 * Date: 2018-02-28 13:47
 */
public class PhoneAreaConfig {

    /** 手机号-国际区号-初始化值 */
    public static final Map<String, String> phoneAreaMap = new LinkedHashMap<String, String>(){
        private static final long serialVersionUID = 1L;{
            put("+86", "中国");
            put("+1", "美国/加拿大");
            put("+886", "中国台湾");
            put("+853", "中国澳门");
            put("+852", "中国香港");
            put("+971", "阿拉伯联合酋长国");
            put("+93", "阿富汗");
            put("+1268", "安提瓜和巴布达");
            put("+1264", "安圭拉");
            put("+355", "阿尔巴尼亚");
            put("+374", "亚美尼亚");
            put("+244", "安哥拉");
            put("+54", "阿根廷");
            put("+1684", "美属萨摩亚");
            put("+43", "奥地利");
            put("+61", "澳大利亚");
            put("+297", "阿鲁巴");
            put("+994", "阿塞拜疆");
            put("+387", "波斯尼亚和黑塞哥维那");
            put("+1246", "巴巴多斯");
            put("+880", "孟加拉国");
            put("+32", "比利时");
            put("+226", "布基纳法索");
            put("+359", "保加利亚");
            put("+973", "巴林");
            put("+257", "布隆迪");
            put("+229", "贝宁");
            put("+1441", "百慕大群岛");
            put("+673", "文莱");
            put("+591", "玻利维亚");
            put("+599", "荷兰加勒比");
            put("+55", "巴西");
            put("+1242", "巴哈马");
            put("+975", "不丹");
            put("+267", "博茨瓦纳");
            put("+375", "白俄罗斯");
            put("+501", "伯利兹");
            put("+243", "刚果民主共和国");
            put("+236", "中非共和国");
            put("+242", "刚果共和国");
            put("+41", "瑞士");
            put("+225", "象牙海岸");
            put("+682", "库克群岛");
            put("+56", "智利");
            put("+237", "喀麦隆");
            put("+57", "哥伦比亚");
            put("+506", "哥斯达黎加");
            put("+53", "古巴");
            put("+238", "开普");
            put("+599", "库拉索");
            put("+357", "塞浦路斯");
            put("+420", "捷克");
            put("+49", "德国");
            put("+253", "吉布提");
            put("+45", "丹麦");
            put("+1767", "多米尼加");
            put("+1809", "多米尼加共和国");
            put("+213", "阿尔及利亚");
            put("+593", "厄瓜多尔");
            put("+372", "爱沙尼亚");
            put("+20", "埃及");
            put("+291", "厄立特里亚");
            put("+34", "西班牙");
            put("+251", "埃塞俄比亚");
            put("+358", "芬兰");
            put("+679", "斐济");
            put("+691", "密克罗尼西亚");
            put("+298", "法罗群岛");
            put("+33", "法国");
            put("+241", "加蓬");
            put("+44", "英国");
            put("+1473", "格林纳达");
            put("+995", "格鲁吉亚");
            put("+594", "法属圭亚那");
            put("+233", "加纳");
            put("+350", "直布罗陀");
            put("+299", "格陵兰岛");
            put("+220", "冈比亚");
            put("+224", "几内亚");
            put("+590", "瓜德罗普岛");
            put("+240", "赤道几内亚");
            put("+30", "希腊");
            put("+502", "瓜地马拉");
            put("+1671", "关岛");
            put("+245", "几内亚比绍共和国");
            put("+592", "圭亚那");
            put("+504", "洪都拉斯");
            put("+385", "克罗地亚");
            put("+509", "海地");
            put("+36", "匈牙利");
            put("+62", "印度尼西亚");
            put("+353", "爱尔兰");
            put("+972", "以色列");
            put("+91", "印度");
            put("+964", "伊拉克");
            put("+98", "伊朗");
            put("+354", "冰岛");
            put("+39", "意大利");
            put("+1876", "牙买加");
            put("+962", "约旦");
            put("+81", "日本");
            put("+254", "肯尼亚");
            put("+996", "吉尔吉斯斯坦");
            put("+855", "柬埔寨");
            put("+686", "基里巴斯");
            put("+269", "科摩罗");
            put("+1869", "圣基茨和尼维斯");
            put("+850", "朝鲜");
            put("+82", "韩国");
            put("+965", "科威特");
            put("+1345", "开曼群岛");
            put("+7", "哈萨克斯坦");
            put("+856", "老挝");
            put("+961", "黎巴嫩");
            put("+1758", "圣露西亚");
            put("+423", "列支敦士登");
            put("+94", "斯里兰卡");
            put("+231", "利比里亚");
            put("+266", "莱索托");
            put("+370", "立陶宛");
            put("+352", "卢森堡");
            put("+371", "拉脱维亚");
            put("+218", "利比亚");
            put("+212", "摩洛哥");
            put("+377", "摩纳哥");
            put("+373", "摩尔多瓦");
            put("+382", "黑山");
            put("+261", "马达加斯加");
            put("+692", "马绍尔群岛");
            put("+389", "马其顿");
            put("+223", "马里");
            put("+95", "缅甸");
            put("+976", "蒙古");
            put("+222", "毛里塔尼亚");
            put("+1664", "蒙特塞拉特岛");
            put("+356", "马耳他");
            put("+230", "毛里求斯");
            put("+960", "马尔代夫");
            put("+265", "马拉维");
            put("+52", "墨西哥");
            put("+60", "马来西亚");
            put("+258", "莫桑比克");
            put("+264", "纳米比亚");
            put("+687", "新喀里多尼亚");
            put("+227", "尼日尔");
            put("+234", "尼日利亚");
            put("+505", "尼加拉瓜");
            put("+31", "荷兰");
            put("+47", "挪威");
            put("+977", "尼泊尔");
            put("+674", "拿鲁岛");
            put("+64", "新西兰");
            put("+968", "阿曼");
            put("+507", "巴拿马");
            put("+51", "秘鲁");
            put("+689", "法属波利尼西亚");
            put("+675", "巴布亚新几内亚");
            put("+63", "菲律宾");
            put("+92", "巴基斯坦");
            put("+48", "波兰");
            put("+508", "圣彼埃尔和密克隆岛");
            put("+1787", "波多黎各");
            put("+351", "葡萄牙");
            put("+680", "帕劳");
            put("+595", "巴拉圭");
            put("+974", "卡塔尔");
            put("+262", "留尼汪");
            put("+40", "罗马尼亚");
            put("+381", "塞尔维亚");
            put("+7", "俄罗斯");
            put("+250", "卢旺达");
            put("+966", "沙特阿拉伯");
            put("+677", "所罗门群岛");
            put("+248", "塞舌尔");
            put("+249", "苏丹");
            put("+46", "瑞典");
            put("+65", "新加坡");
            put("+386", "斯洛文尼亚");
            put("+421", "斯洛伐克");
            put("+232", "塞拉利昂");
            put("+378", "圣马力诺");
            put("+221", "塞内加尔");
            put("+252", "索马里");
            put("+597", "苏里南");
            put("+239", "圣多美和普林西比");
            put("+503", "萨尔瓦多");
            put("+963", "叙利亚");
            put("+268", "斯威士兰");
            put("+1649", "特克斯和凯科斯群岛");
            put("+235", "乍得");
            put("+228", "多哥");
            put("+66", "泰国");
            put("+992", "塔吉克斯坦");
            put("+670", "东帝汶");
            put("+993", "土库曼斯坦");
            put("+216", "突尼斯");
            put("+676", "汤加");
            put("+90", "土耳其");
            put("+1868", "特立尼达和多巴哥");
            put("+255", "坦桑尼亚");
            put("+380", "乌克兰");
            put("+256", "乌干达");
            put("+598", "乌拉圭");
            put("+998", "乌兹别克斯坦");
            put("+1784", "圣文森特和格林纳丁斯");
            put("+58", "委内瑞拉");
            put("+1284", "英属处女群岛");
            put("+84", "越南");
            put("+678", "瓦努阿图");
            put("+685", "萨摩亚");
            put("+967", "也门");
            put("+269", "马约特");
            put("+27", "南非");
            put("+260", "赞比亚");
            put("+263", "津巴布韦");
        }
    };

    /** 国际区号-中国 */
    public static final String PHONE_AREA_CHINA = "+86";


    /** Andorra	安道尔 */
    public static final String AD =	"376";

    /** United Arab Emirates	阿拉伯联合酋长国 */
    public static final String AE = "971";

    /** Afghanistan	阿富汗 */
    public static final String AF = "93";

    /** Antigua and Barbuda	安提瓜和巴布达 */
    public static final String AG = "1268";

    /** Anguilla	安圭拉	 */
    public static final String AI = "1264";

    /** Albania	阿尔巴尼亚	*/
    public static final String AL = "355";

    /** Armenia	亚美尼亚	*/
    public static final String AM = "374";

    /** Angola	安哥拉	*/
    public static final String AO = "244";

    /** Argentina	阿根廷	*/
    public static final String AR = "54";

    /** American Samoa	美属萨摩亚	*/
    public static final String AS = "1684";

    /** Austria	奥地利	*/
    public static final String AT = "43";

    /** Australia	澳大利亚	*/
    public static final String AU = "61";

    /** Aruba	阿鲁巴	*/
    public static final String AW = "297";

    /** Azerbaijan	阿塞拜疆	*/
    public static final String AZ = "994";

    /** Bosniaand Herzegovina	波斯尼亚和黑塞哥维那*/
    public static final String BA = "387";

    /** Barbados	巴巴多斯	*/
    public static final String BB = "1246";

    /** Bangladesh	孟加拉国	*/
    public static final String BD = "880";

    /** Belgium	比利时	*/
    public static final String BE = "32";

    /** Burkina Faso	布基纳法索	*/
    public static final String BF = "226";

}
